//==============================================================================
// ■ Game_CommonEvent
//------------------------------------------------------------------------------
// 　コモンイベントを扱うクラスです。並列処理イベントを実行する機能を持っていま
// す。このクラスは Game_Map クラス（$game_map）の内部で使用されます。
//==============================================================================

class Game_CommonEvent
  //--------------------------------------------------------------------------
  // ● オブジェクト初期化
  //--------------------------------------------------------------------------
  public initialize(common_event_id)
    @event = $data_common_events[common_event_id]
    refresh
  }
  //--------------------------------------------------------------------------
  // ● リフレッシュ
  //--------------------------------------------------------------------------
  public refresh
    if active?
      @interpreter ||= Game_Interpreter.new
    else
      @interpreter = nil
    }
  }
  //--------------------------------------------------------------------------
  // ● 有効状態判定
  //--------------------------------------------------------------------------
  public active?
    @event.parallel? && $game_switches[@event.switch_id]
  }
  //--------------------------------------------------------------------------
  // ● フレーム更新
  //--------------------------------------------------------------------------
  public update
    if @interpreter
      @interpreter.setup(@event.list) unless @interpreter.running?
      @interpreter.update
    }
  }
}
