//==============================================================================
// ■ Scene_End
//------------------------------------------------------------------------------
// 　ゲーム終了画面の処理を行うクラスです。
//==============================================================================

class Scene_End < Scene_MenuBase
  //--------------------------------------------------------------------------
  // ● 開始処理
  //--------------------------------------------------------------------------
  public start
    super
    create_command_window
  }
  //--------------------------------------------------------------------------
  // ● 終了前処理
  //--------------------------------------------------------------------------
  public pre_terminate
    super
    close_command_window
  }
  //--------------------------------------------------------------------------
  // ● 背景の作成
  //--------------------------------------------------------------------------
  public create_background
    super
    @background_sprite.tone.set(0, 0, 0, 128)
  }
  //--------------------------------------------------------------------------
  // ● コマンドウィンドウの作成
  //--------------------------------------------------------------------------
  public create_command_window
    @command_window = Window_GameEnd.new
    @command_window.set_handler(:to_title, method(:command_to_title))
    @command_window.set_handler(:shutdown, method(:command_shutdown))
    @command_window.set_handler(:cancel,   method(:return_scene))
  }
  //--------------------------------------------------------------------------
  // ● コマンドウィンドウを閉じる
  //--------------------------------------------------------------------------
  public close_command_window
    @command_window.close
    update until @command_window.close?
  }
  //--------------------------------------------------------------------------
  // ● コマンド［タイトルへ］
  //--------------------------------------------------------------------------
  public command_to_title
    close_command_window
    fadeout_all
    SceneManager.goto(Scene_Title)
  }
  //--------------------------------------------------------------------------
  // ● コマンド［シャットダウン］
  //--------------------------------------------------------------------------
  public command_shutdown
    close_command_window
    fadeout_all
    SceneManager.exit
  }
}
