//==============================================================================
// ■ Sprite_Picture
//------------------------------------------------------------------------------
// 　ピクチャ表示用のスプライトです。Game_Picture クラスのインスタンスを監視し、
// スプライトの状態を自動的に変化させます。
//==============================================================================

class Sprite_Picture < Sprite
  //--------------------------------------------------------------------------
  // ● オブジェクト初期化
  //     picture : Game_Picture
  //--------------------------------------------------------------------------
  public initialize(viewport, picture)
    super(viewport)
    @picture = picture
    update
  }
  //--------------------------------------------------------------------------
  // ● 解放
  //--------------------------------------------------------------------------
  public dispose
    bitmap.dispose if bitmap
    super
  }
  //--------------------------------------------------------------------------
  // ● フレーム更新
  //--------------------------------------------------------------------------
  public update
    super
    update_bitmap
    update_origin
    update_position
    update_zoom
    update_other
  }
  //--------------------------------------------------------------------------
  // ● 転送元ビットマップの更新
  //--------------------------------------------------------------------------
  public update_bitmap
    self.bitmap = Cache.picture(@picture.name)
  }
  //--------------------------------------------------------------------------
  // ● 原点の更新
  //--------------------------------------------------------------------------
  public update_origin
    if @picture.origin == 0
      self.ox = 0
      self.oy = 0
    else
      self.ox = bitmap.width / 2
      self.oy = bitmap.height / 2
    }
  }
  //--------------------------------------------------------------------------
  // ● 位置の更新
  //--------------------------------------------------------------------------
  public update_position
    self.x = @picture.x
    self.y = @picture.y
    self.z = @picture.number
  }
  //--------------------------------------------------------------------------
  // ● 拡大率の更新
  //--------------------------------------------------------------------------
  public update_zoom
    self.zoom_x = @picture.zoom_x / 100.0
    self.zoom_y = @picture.zoom_y / 100.0
  }
  //--------------------------------------------------------------------------
  // ● その他の更新
  //--------------------------------------------------------------------------
  public update_other
    self.opacity = @picture.opacity
    self.blend_type = @picture.blend_type
    self.angle = @picture.angle
    self.tone.set(@picture.tone)
  }
}
