/// <reference path='./Game_CommonEvent.ts' />

//==============================================================================
// ■ Game_Temp;
//------------------------------------------------------------------------------
// 　セーブデータに含まれない、一時的なデータを扱うクラスです。このクラスのイン
// スタンスは DataManager.gameTemp で参照されます。
//==============================================================================

module ebi {
    export module rpg {
        export class Game_Temp {
            //--------------------------------------------------------------------------
            // # Private
            //--------------------------------------------------------------------------
            private commonEventId_: number; // コモンイベント ID;
            private fadeType_: number;      // 場所移動時のフェードタイプ

            //--------------------------------------------------------------------------
            // ● 公開インスタンス変数
            //--------------------------------------------------------------------------
            public get commonEventId(): number {return this.commonEventId_;} 
            public get fadeType(): number {return this.fadeType_;}                    
            public set fadeType(value: number) {this.fadeType_ = value;}                                              
            
            //--------------------------------------------------------------------------
            // ● オブジェクト初期化
            //--------------------------------------------------------------------------
            constructor() {
                this.commonEventId_ = 0;
                this.fadeType_ = 0;
            }

            //--------------------------------------------------------------------------
            // ● コモンイベントの呼び出しを予約
            //--------------------------------------------------------------------------
            public reserveCommonEvent(commonEventId: number): void {
                this.commonEventId_ = commonEventId;
            }

            //--------------------------------------------------------------------------
            // ● コモンイベントの呼び出し予約をクリア
            //--------------------------------------------------------------------------
            public clearCommonEvent(): void {
                this.commonEventId_ = 0;
            }

            //--------------------------------------------------------------------------
            // ● コモンイベント呼び出しの予約判定
            //--------------------------------------------------------------------------
            public isCommonEventReserved(): bool {
                return this.commonEventId_ > 0;
            }

            //--------------------------------------------------------------------------
            // ● 予約されているコモンイベントを取得
            //--------------------------------------------------------------------------
            public reservedCommonEvent(): Game_CommonEvent {
                return DataManager.dataCommonEvents[this.commonEventId_];
            }
         }
    }
}

