/// <reference path='../../underscore.d.ts' />
/// <reference path='./Game_Picture.ts' />

//==============================================================================
// ■ Game_Pictures;
//------------------------------------------------------------------------------
// 　ピクチャの配列のラッパーです。このクラスは Game_Screen クラスの内部で使用
// されます。マップ画面のピクチャとバトル画面のピクチャは別々に扱われます。
//==============================================================================

module ebi {
    export module rpg {
        class Game_Pictures {
            //--------------------------------------------------------------------------
            // Private
            //--------------------------------------------------------------------------
            private data_: Game_Picture[];
            //--------------------------------------------------------------------------
            // ● オブジェクト初期化
            //--------------------------------------------------------------------------
            constructor {
                this.data_ = [];
            }

            //--------------------------------------------------------------------------
            // ● ピクチャの取得
            //--------------------------------------------------------------------------
            public get(index: number): Game_Picture {
                this.data_[index] ? this.data_[index] : new Game_Picture(index);
                return this.data_[index];
            }

            //--------------------------------------------------------------------------
            // ● イテレータ
            //--------------------------------------------------------------------------
            public each(func: (picture: Game_Picture) => {}): void {
                _.each(_.compact(this.data_), (picture: Game_Picture)=>{
                    func(picture);
                });
            }
        }
    }
}

